In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Stock_data.csv")
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3     RIL  not available       50   1023  mukesh ambani
4    TATA            5.6       -1     -1     ratan tata

In [3]:
#Skip rows from the top
df1 = pd.read_csv("Stock_data.csv", skiprows = 1)
df1

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2   RIL  not available   50  1023  mukesh ambani
3  TATA            5.6   -1    -1     ratan tata

In [4]:
#add a header if we don't have any - 
df2 = pd.read_csv("Stock_data.csv", header = None, names =["Ticker", "eps", "revenue", "price", "people"])
df2

    Ticker            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4      RIL  not available       50   1023  mukesh ambani
5     TATA            5.6       -1     -1     ratan tata

In [5]:
#if we want to read only some line from the csv file then - 
df3 = pd.read_csv("Stock_data.csv", nrows = 4)
df3

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3     RIL  not available       50   1023  mukesh ambani

In [6]:
#convert all the unwanted values to - NaN
df4 = pd.read_csv("Stock_data.csv", na_values=["not available", "n.a.", "-1"])
df4

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [7]:
#we can provide a condition before formatting, like we can decide which rows we should use NaN values by using dictionary
df5 = pd.read_csv("Stock_data.csv", na_values={
    'eps': ["not available", "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", "n.a."]
})
df5

  tickers    eps  revenue  price         people
0   GOOGL  27.82     87.0    845     larry page
1     WMT   4.61    484.0     65            NaN
2    MSFT  -1.00     85.0     64     bill gates
3     RIL    NaN     50.0   1023  mukesh ambani
4    TATA   5.60      NaN     -1     ratan tata

In [8]:
#writing back to cse
# *****

In [9]:
df.to_csv('new.csv', index=False)
# df.to_csv('new.csv')

In [10]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [11]:
df.to_csv('new.csv', index=False, columns = ['tickers', 'eps']) #Only col which we wants

In [12]:
#header = False

In [13]:
#-----------------------------------------------------------------------------now For Excal file

In [14]:
import pandas as pd
df = pd.read_excel("Stock_data.xlsx", "Sheet1")
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3     RIL  not available       50   1023  mukesh ambani
4    TATA            5.6       -1     -1     ratan tata

In [15]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\abhiraj\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\abhiraj\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [24]:
#we are going to convert na val to some name by making some new funtions
#here we are using Converters
import pandas as pd
def convert_people_cell(cell):
    if cell =="n.a.":
        return 'sam Walton'
    return cell
def convert_eps_cell(cell):
    if cell == "not available":
        return None
    return cell

        
df = pd.read_excel("Stock_data.xlsx", "Sheet1", converters = {
    'people':convert_people_cell,
    'eps':convert_eps_cell,
    
})
df

  tickers    eps  revenue  price         people
0   GOOGL  27.82       87    845     larry page
1     WMT   4.61      484     65     sam Walton
2    MSFT  -1.00       85     64     bill gates
3     RIL    NaN       50   1023  mukesh ambani
4    TATA   5.60       -1     -1     ratan tata

In [17]:
# Writhing Back to Excel file

In [18]:
# df.to_excel("new.xlsx", sheet_name="stocks")
df.to_excel("new.xlsx", sheet_name="stocks", startrow=1, startcol=2)
#we can provide the staring area/point from where our sheet startb

In [19]:
#We can convert Data Frame to excel with ExcelWriter - it a inbuild funtion in pandas

In [20]:
df_stocks = pd.DataFrame({
    'tickers':['GOOGL', 'WMT', 'MSFT'],
    'price':[845, 65, 64],
    'pe':[30.37, 14.26, 30.97],
    'eps':[27.82, 4.61, 2.12]
})
df_weather = pd.DataFrame({
    'tickers':['GOOGL', 'WMT', 'MSFT'],
    'price':[845, 65, 64],
    'pe':[30.37, 14.26, 30.97],
    'eps':[27.82, 4.61, 2.12]
})

In [21]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name = "stocks")
    df_weather.to_excel(writer, sheet_name = "weather")